БПКР/src/InformationRegisters/СчетаРасчетовСКонтрагентами/СчетаРасчетовСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаРасчетовСКонтрагентами</name>
  <resources>
    <name>СчетРасчетовПоставщика</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетАвансовПоставщика</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетРасчетовПокупателя</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетАвансовПокупателя</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетРасчетовПоЗаймам</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/СчетаРасчетовСКонтрагентами/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Это старая запись.
	Если ЗначениеЗаполнено(Параметры.Ключ.Организация)
		Или ЗначениеЗаполнено(Параметры.Ключ.Контрагент) 
		Или ЗначениеЗаполнено(Параметры.Ключ.Договор) Тогда 
		ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	ТолькоПросмотр = Ложь;
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьСчетаУчета(Команда)
	Если ЗначениеЗаполнено(Запись.СчетРасчетовПоставщика) Тогда 
		ТекстВопроса = НСтр("ru = 'Буду перезаполнены счета учета. Продолжить выполнение операции?'");
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);

		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСчетаУчетаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
Процедура ОтветНаВопросЗаполнитьСчетаУчета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСчетаУчетаНаСервере();
	КонецЕсли; 
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСчетаУчетаНаСервере()

	СчетаУчета = БухгалтерскийУчетСервер.ПолучитьСчетаРасчетовСКонтрагентом(Запись.Организация, Запись.Контрагент, Запись.Договор);
	ЗаполнитьЗначенияСвойств(Запись, СчетаУчета, "СчетРасчетовПоставщика, СчетАвансовПоставщика, СчетРасчетовПокупателя, СчетАвансовПокупателя, СчетРасчетовПоЗаймам"); 	

КонецПроцедуры 
	
#КонецОбласти
